tasks/02-conf/src/Configuration/Documents/ВыбытиеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВыбытиеОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ОборудованиеВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

tasks/02-conf/src/Configuration/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

tasks/02-conf/src/Configuration/AccumulationRegisters/ОборудованиеВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОборудованиеВЭксплуатации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

tasks/02-conf/src/Configuration/Documents/ВыбытиеОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	// Регистрируем движения: списание с остатков и ввод в эксплуатацию
	Движения.ОстаткиНоменклатуры.Записать();
	Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	
	Движения.ОборудованиеВЭксплуатации.Записать();
	Движения.ОборудованиеВЭксплуатации.Записывать = Истина;
	
	НачалоДняДокумента = НачалоДня(Дата);
	
	// ===== КРИТИЧЕСКИЙ МОМЕНТ: БЛОКИРОВКА ДАННЫХ =====
	//По остаткам номенклатуры блокируем по срокам годности, диапазон ДО начала дня документа, так как
	//мы смотрим просроченную номенклатуру, по оборудованию в эксплуатацию блокируются как сроки годности, так и
	//сроки эксплуатации, диапазон так же ДО начала дня документа.
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("СрокГодности", Новый Диапазон(,НачалоДняДокумента));
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОборудованиеВЭксплуатации");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("СрокГодности", Новый Диапазон(,НачалоДняДокумента));
	ЭлементБлокировки.УстановитьЗначение("СрокЭксплуатации", Новый Диапазон(,НачалоДняДокумента));
	Блокировка.Заблокировать();
	
	// ===== ЗАПРОС К ДВУМ РЕГИСТРАМ НАКОПЛЕНИЯ =====
   	//Получаем остатки по двум регистрам накопления, с истёкшими сроками годности и
	//сроками экспулатации.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.СрокГодности КАК СрокГодности,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиНоменклатурыОстатки.СебестоимостьОстаток КАК Себестоимость
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментВремени, СрокГодности < &НачалоДня) КАК ОстаткиНоменклатурыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборудованиеВЭксплуатацииОстатки.Номенклатура КАК Номенклатура,
		|	ОборудованиеВЭксплуатацииОстатки.СрокГодности КАК СрокГодности,
		|	ОборудованиеВЭксплуатацииОстатки.СрокЭксплуатации КАК СрокЭксплуатации,
		|	ОборудованиеВЭксплуатацииОстатки.КоличествоОстаток КАК Количество,
		|	ОборудованиеВЭксплуатацииОстатки.СебестоимостьОстаток КАК Себестоимость
		|ИЗ
		|	РегистрНакопления.ОборудованиеВЭксплуатации.Остатки(
		|			&МоментВремени,
		|			СрокГодности < &НачалоДня
		|				ИЛИ СрокЭксплуатации < &НачалоДня) КАК ОборудованиеВЭксплуатацииОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("НачалоДня", НачалоДняДокумента);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапросов[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
	КонецЦикла;  
	
	Выборка = РезультатыЗапросов[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОборудованиеВЭксплуатации.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
	КонецЦикла;
	
КонецПроцедуры
